{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Neo4Jupyter\n",
    "Based on examples available at: http://nicolewhite.github.io/neo4j-jupyter/hello-world.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Authenticate\n",
    "If you do not disable the authentication, you need to authenticate first.\n",
    "\n",
    "To disable the authentication: \n",
    "* Go to the location where you create your database (when you initialize the Neo4j server) \n",
    "* Edit the file \".neo4j.conf\". \n",
    "* Change the option **dbms.security.auth_enable** from **true** to **false**.\n",
    "* Restart the server"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# you do not need this if you disable the authentication\n",
    "from py2neo import authenticate\n",
    "authenticate(\"localhost:7474\", \"neo4j\", \"password\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Starting the Graphic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "graph = Graph()\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Visualization\n",
    "In order to visualize the graphic, you need to use the vis.py script. Also you need to create a \"figure\" folder (if it does not exist).\n",
    "\n",
    "This script is available inside the script folder. \n",
    "\n",
    "If you change the location of the script folder, you need to modify the vis.py script in order to point to the correct location for the CSS library."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "from scripts.vis import draw"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-1514526b-0114-482a-a550-f450e1292382.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10886e630>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-e4033035-36d8-4083-948a-f9612908cd68.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x1088c2438>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Drew', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/gusbru/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.\n",
      "  \"You should import from traitlets.config instead.\", ShimWarning)\n",
      "/Users/gusbru/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.\n",
      "  warn(\"IPython.utils.traitlets has moved to a top-level traitlets package.\")\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Drew', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "#### NetworkX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAp4AAAG+CAYAAAA6MgQ4AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAAPYQAAD2EBqD+naQAAIABJREFUeJzt3Wt4VOW9/vF7wkAgBhRBwGqBQASSCCieqLQeCcpBKxLk\nNKPbQuQgKAcJ1bJrdzW2glUEigFiS10TgkBADoISlYMCKqjlNJCQEEAqAoICISQwyfxfYP2rQSRk\nZj2TzPfzZl/XWjPPunttLrn5zVrrcfj9fr8AAACAIIswHQAAAADhgeIJAAAAW1A8AQAAYAuKJwAA\nAGxB8QQAAIAtKJ4AAACwBcUTAAAAtqB4AgAAwBYUTwAAANiC4gkAAABbUDwBAABgC4onAAAAbEHx\nBAAAgC0ongAAALAFxRMAAAC2oHgCAADAFhRPAAAA2ILiCQAAAFtQPAEAAGALiicAAABsQfEEAACA\nLSieAAAAsAXFEwAAALageAIAAMAWFE8AAADYguIJAAAAW1A8AQAAYAuKJwAAAGxB8QQAAIAtKJ4A\nAACwBcUTAAAAtqB4AgAAwBYUTwAAANiC4gkAAABbUDwBAABgC4onAAAAbEHxBAAAgC0ongAAALAF\nxRMAAAC2oHgCAADAFhRPAAAA2ILiCQAAAFtQPAEAAGALiicAAABsQfEEAACALSieAAAAsAXFEwAA\nALageAIAAMAWFE8AAADYguIJAAAAW1A8AQAAYAuKJwAAAGxB8QQAAIAtKJ4AAACwBcUTAAAAtqB4\nAgAAwBYUTwAAANiC4gkAAABbUDwBAABgC4onAAAAbEHxBAAAgC2cpgMA+KHCwkLl5eWppKREkZGR\nio2NVXR0tOlYAABUGsUTCAFer1dpaWnKXrZMObt2ye/3f3fO4XCodYsWSuzWTUOGDFF8fLzBpAAA\nXDiH//t/wwGwVUFBgYYNHqy3srPVyOlUL59PN0iKlxQlqUiSV9IGSVlOpw76fLo7MVHTpk9XTEyM\nyegAAFQYxRMwJD09XSNHjFBDn0/P+XxKklTrHJ8/JWm+pCedTh12OjVpyhQNGjTInrAAAAQADxcB\nBqSmpio5OVn9iou1xedTf527dOrb8/0lbfX51K+4WMnJyUpNTQ1+WAAAAoSJJ2Cz9PR0JScn6xlJ\n4yuxzjOS/vjtegMHDgxMOAAAgojiCdiooKBAbePj1a+4WDMruZZf0iOSMmvX1havl3s+AQAhj+IJ\n2Khrly7avnKltvh8qhuA9Y5Jaut0Kv7227V8xYoArAgAQPBQPAGbeL1eJSQkKENn7tUMlNmSBny7\nflxcXABXBgAgsHi4CLBJWlqaGjmdSgrwur0kNXI69corrwR4ZQAAAoviCdgke9ky9fL5fvbp9YqK\nlNTL59M7y5cHeGUAAAKL4gnY4Pjx48rZtUs3BGn96yXtyM9XYWFhkK4AAEDlUTwBG+Tn58vv9ytY\nm10mSPL7/crLywvSFQAAqDyKJ2CDkpISSWe2wQyGOj+6DgAAoYjiCdggMjJS0pm914Ph5I+uAwBA\nKKJ4AjaIjY2Vw+GQN0jrb5PkcDgUGxsbpCsAAFB5FE/ABtHR0WrdooU2BGn9jZLatGyp6OjoIF0B\nAIDKo3gCNkns1k1ZTqdOBXjdEkmvSzpaVKSZM2fqm2++CfAVAAAIDIonYJMhQ4booM+n+QFeN0vS\nEUnNmzfXkCFD1LhxYyUlJWnRokU6dSrQNRcAgAtH8QRsEh8fr7sTE/WU06njAVrzmKQnnU7dnZio\ntWvXat++ffrLX/6i/Px83Xfffbr88ss1bNgwrV+/XuyOCwAwjb3aARsVFBSobXy8+hUXa2Yl1/JL\nekRSZu3a2uL1KiYm5gfnt27dKo/Ho4yMDO3bt08tW7aUy+WSy+XiISQAgBEUT8Bm6enpSk5O1jOS\nxl/gGn5Jz0r647frDRw48Cc/W1ZWptWrV8uyLM2fP1/Hjx9Xx44d5Xa79cADD6hhw4YXmAIAgIqh\neAIGpKamavz48Roo6SVJdSvw3WOSxkhK/3adp5566ry/e/LkSS1evFgej0dvvfWWJKlbt25yu93q\n0aOHateuXYEkAABUDMUTMGTmzJl6dMgQNSor0wRJSZJqnePzJTrzINGTTqcOO516eerUc046f86h\nQ4c0Z84cWZalDRs26OKLL1bv3r3ldrv161//WhER3AIOAAgsiidgyJIlS3TvvfeqQ/v2+nTTJjVy\nOtXL59P1OrP3eh2d2ZFom868pzPL6dRBn093JyZq2vTp5e7prIycnBx5PB55PB7t3r1bzZo104AB\nA+RyuRQXFxew6wAAwhvFEzCguLhYCQkJatmypd5++21t375daWlpemf5cu3Iz//BE+gOh0NtWrZU\n565dNXTo0KAWwbKyMq1bt06WZWnu3Ln65ptvdN1118ntdqtv375q3Lhx0K4NAKj+KJ6AAampqfrT\nn/6kLVu2qE2bNj84V1hYqLy8PJWUlCgyMlKxsbFGdiQqKSnRm2++Kcuy9Oabb6qsrExdunSR2+3W\nb3/7W0VFRdmeCQBQtVE8AZt9/vnnatOmjYYOHaoXXnjBdJzzcuTIEc2dO1cej0dr165VdHS0evXq\nJbfbrdtuu001atQwHREAUAVQPAGb9enTR2vWrFFOTo7q1atnOk6F7dq1Sx6PR5ZlKS8vT1dccYX6\n9+8vl8uldu3amY4HAAhhFE/ARitXrtQdd9yhf/3rX3rwwQdNx6kUv9+vjz/+WJZlac6cOTp8+LDa\ntWsnt9utfv366YorrjAdEQAQYiiegE18Pp+uvfZa1a1bVx988EG1el3R6dOn9dZbb8myLC1evFin\nTp3SnXfeKbfbrZ49e6pu3Yq8qRQAUF1RPAGbTJ48WSNHjtTGjRvVoUMH03GC5ujRo5o/f74sy9Lq\n1atVp04d9ezZUy6XS4mJiXI6naYjAgAMoXgCNjh48KBatWqlPn36aPr06abj2Gbv3r3KyMiQZVna\nvn27GjdurH79+snlcqlDhw5yOBymIwIAbETxBGyQnJysrKws5ebmhuXe6H6/X5999pksy1JmZqYO\nHDiguLg4ud1u9e/fX82aNTMdEQBgA4onEGQbN27UjTfeqClTpujRRx81Hcc4n8+nd955R5ZlaeHC\nhTp58qRuvfVWud1uJSUl6eKLLzYdEQAQJBRPIIjKysp088036+TJk/rkk0+4v/FHjh8/roULF8qy\nLL377ruqVauW7r33Xrndbt11112qVetcu9cDAKoaiicQRLNmzdLDDz+s1atX65ZbbjEdJ6T95z//\nUWZmpjwejzZt2qQGDRqob9++crlcuummm7gfFACqAYonECRHjx5Vq1atdOedd2r27Nmm41QpW7Zs\nkWVZysjI0BdffKGrrrpKLpdLAwYMUMuWLU3HAwBcIIonECSjR4/WjBkzlJOTw8vUL1BpaalWrVol\ny7KUlZWlwsJC3XzzzXK73XrggQd06aWXmo4IAKgAiicQBF6vV+3bt9czzzyj3//+96bjVAtFRUVa\ntGiRLMvSihUrFBERoe7du8vtdqt79+6KjIw0HREA8DMonkCA+f1+JSYmau/evdqyZQuFKAgOHDig\nOXPmyLIsffLJJ7rkkkv0wAMPyOVyqVOnTtVqVygAqE4onkCAZWVlKSkpSW+++aa6detmOk61t337\ndnk8Hnk8Hu3du1fNmzeXy+WSy+VS69atTccDAHwPxRMIoKKiIsXFxaldu3ZasmSJ6ThhpaysTB98\n8IEsy9K8efN09OhR3XDDDXK73erTp48aNWpkOiIAhD2KJxBATz/9tP76179q27Ztio2NNR0nbBUX\nF2vp0qWyLEvLli2T3+/X3XffLZfLpd/+9reqU6eO6YgAEJYonkCAFBQUKC4uTqNHj9Zzzz1nOg6+\n9dVXX2nu3LmyLEsffvih6tatq6SkJLlcLt12223cDwoANqJ4AgHSs2dPbdiwQTt27FB0dLTpODiL\nvLy87+4Hzc/P15VXXqkBAwbI5XLp6quvNh0PAKo9iicQACtWrNBdd92lzMxM9e3b13Qc/Ay/368P\nP/xQlmXp9ddf15EjR3TNNdfI5XKpf//+uvzyy01HBIBqieIJVNKpU6fUrl07NWnSRCtXrmRrxyrm\n1KlTWr58uSzL0pIlS+Tz+dS5c2e5XC717NmT6TUABBDFE6ikF154QePGjdNnn32mdu3amY6DSvjm\nm280b948WZal999/X1FRUbr//vvlcrl05513yul0mo4IAFUaxROohP3796tVq1b6n//5H02ZMsV0\nHATQ7t27lZGRIcuylJOToyZNmqh///5yuVy65pprmGwDwAWgeAKV8OCDD2r58uXKzc1V/fr1TcdB\nEPj9fn3yySeyLEuZmZk6dOiQEhIS5HK5NGDAAP3yl780HREAqgyKJ3CB1q1bp06dOmnGjBlKTk42\nHQc2OH36tLKzs2VZlt544w2VlJTotttuk8vlUlJSkurVq2c6IgCENIoncAFKS0t1ww03KCIiQh99\n9JFq1KhhOhJsduzYMS1YsECWZWnlypWKjIzUb3/7W7lcLt11112qWbOm6YgAEHIonsAFmD59uoYM\nGaL169erY8eOpuPAsH379mn27NmyLEtbt27VZZddpr59+8rlcumGG27gflAA+BbFE6igI0eOqFWr\nVurRo4dmzZplOg5CiN/v1+bNm2VZlmbPnv3dw2dut1sDBgxQTEyM6YgAYBTFE6igRx99VJZlKTc3\nV02aNDEdByGqtLRU7733nizL0oIFC3TixAn9+te/lsvl0gMPPMDDaADCEsUTqIBNmzapQ4cOmjhx\nokaPHm06DqqIEydO6I033pBlWcrOzpbT6VSPHj3kcrnUrVs3RUZGmo4IALageALnye/369Zbb9VX\nX32lTZs28fAILsiXX36pzMxMWZalzz77TPXr11efPn3kcrl08803cz8ogGqN4gmcp8zMTPXv31/Z\n2dnq3Lmz6TioBrZt2yaPx6OMjAx9/vnnatGihQYMGCC3262rrrrKdDwACDiKJ3AeCgsL1bp1a3Xs\n2FFZWVmm46CaKSsr05o1a2RZlubPn69jx47ppptuksvlUt++fdWwYUPTEQEgICiewHl48sknNWnS\nJG3fvl3Nmzc3HQfV2MmTJ7VkyRJZlqW33npLktS1a1e5XC7dc889qlOnjuGEAHDhKJ7Az9i5c6cS\nEhL0hz/8QU8//bTpOAgjhw4d0uuvvy6Px6OPPvpI9erVU1JSktxut2655RZFRESYjggAFULxBH5G\n9+7d5fV65fV6mTbBmNzcXHk8Hnk8HhUUFOiXv/zld/eDxsfHm44HAOeF4gmcw9KlS3XPPfdowYIF\n6tmzp+k4gPx+v9atWyfLsjR37lx9/fXX6tChg1wul/r168e7ZQGENIon8BOKi4t19dVXq0WLFnr7\n7bd5zQ1CTklJiZYtWybLsrR06VKVlpaqS5cucrlcuu+++3TRRReZjggAP0DxBH7Cc889p6efflpb\ntmxRmzZtTMcBzunIkSOaN2+eLMvS2rVrddFFF+n++++X2+3WHXfcoRo1apiOCAAUT+BsPv/8c7Vp\n00ZDhw7VCy+8YDoOUCG7du1SRkaGLMvSzp07dfnll6t///5yu91q37696XgAwhjFEziLvn37atWq\nVcrNzVW9evVMxwEuiN/v14YNG2RZlubMmaOvvvpKbdu2lcvlUv/+/XXllVeajgggzFA8gR9ZtWqV\nbr/9ds2aNUsPPfSQ6ThAQJw+fVpvv/22LMvS4sWLVVJSojvuuEMul0u9evVS3bp1TUcEEAYonsD3\n+Hw+dejQQRdddJHWrl3LexJRLR09elRZWVmyLEurVq1SnTp1dN9998nlcqlLly5yOp2mIwKopiie\nwPdMmTJFjz/+uDZs2KDrrrvOdBwg6Pbu3avZs2fLsix5vV41atRIffv2ldvt1nXXXcfbHAAEFMUT\n+NahQ4fUqlUr9e7dWzNmzDAdB7CV3+/Xv//9b1mWpdmzZ+vAgQNq06aNXC6XBgwYwFaxAAKC4gl8\nKzk5WfPnz1dubq4uu+wy03EAY3w+n959911ZlqWFCxeqqKhIt9xyi1wul3r37q1LLrnEdEQAVRTF\nE5C0ceNG3XjjjZo8ebKGDx9uOg4QMgoLC7Vw4UJZlqV3331XNWvW1D333COXy6WuXbuqVq1apiMC\nqEIongh7ZWVluvnmm1VUVKRPP/2UByuAn/DFF18oMzNTlmVp06ZNuvTSS9WnTx+53W517NiR+0EB\n/CyKJ8LerFmz9PDDD2vVqlW69dZbTccBqoQtW7bI4/EoIyND//nPf9SyZUu5XC65XC7Fxsaajgcg\nRFE8EdaOHj2qVq1a6Y477lBmZqbpOECVU1paqtWrV8uyLM2fP1+FhYXq2LGj3G63+vTpowYNGpiO\nCCCEUDwR1kaPHq3p06crJyeHXVyASioqKtLixYtlWZbefvttRUREqGvXrnK73erRo4dq1679g8+X\nlZXpxIkTvLweCCO8HRthy+v1asqUKRo/fjylEwiAqKgo9e3bV2+++aa++OILvfDCC/riiy/Uu3dv\nNWnSRMnJyVqzZo3KysokSWvWrFHjxo3Vv39/LV++XD6fz/D/AgDBxsQTYcnv9ysxMVF79uzR1q1b\nFRkZaToSUG3t2LFDHo9HHo9He/bsUbNmzTRgwADl5OQoKyvru881atRI/fr1k8vl4uX1QDVF8URY\nWrBggXr16qWlS5eqe/fupuMAYaGsrExr166VZVl6/fXXdezYsZ/8bJs2beR2uzVgwAA1a9bMxpQA\ngoniibBTVFSk+Ph4XX311Vq6dKnpOEBY8ng8crvd5/XZW265RW63W0lJSby8HqjiuMcTYWfChAna\nv3+/Jk2aZDoKELbmzp173p9ds2aNkpOT1aRJE/Xu3VuLFy/WqVOngpgOQLAw8URY2b17t+Li4jRq\n1Cg999xzpuMAYevH7wGtqAYNGnz38vqbbrqJ+0GBKoLiibBy//336+OPP9aOHTsUHR1tOg4Q9kpL\nS7Vq1SpZlqWsrCwVFhZWeI3Y2NjvXl7fsmXLIKQEECgUT4SN7OxsdenSRZmZmerbt6/pOAB+pKio\nSIsWLZLH49Hbb7+t0tLSCq/xq1/9Sm63Ww888AAvrwdCEMUTYeHUqVNq3769GjdurJUrV/KzHBDi\nDhw4oDlz5sjj8Wjjxo0V/n7NmjXVrVs3ud1ude/evdzL6wGYQfFEWPjb3/6mlJQUffbZZ2rXrp3p\nOAAqYPv27crIyPjuPaAVdckll6h3795yu93q1KmTIiJ4rhYwheKJam///v1q3bq1HnroIU2ZMsV0\nHAAXqKysTB988IE8Ho/mzp2ro0ePVniN5s2ba8CAAXK5XGrTpk0QUgI4F4onqr2HHnpIy5YtU25u\nrurXr286DoAAKC4u1tKlS+XxeLRs2TKdPn26wmtcf/31crvd6tu3rxo1ahSElAB+jOKJam3dunXq\n1KmTZsyYoeTkZNNxAATB4cOH9frrr8vj8Wj9+vUV/n6NGjV01113ye12695771VUVFQQUkqFhYXK\ny8tTSUmJIiMjFRsby9s1EHYonqi2SktLdeONN8rhcOijjz5SjRo1TEcCEGR5eXnf7Qufn59f4e/X\nrVtXvXr1ktvt1q233lrp/254vV6lpaUpe9ky5ezape//letwONS6RQslduumIUOGKD4+vlLXAqoC\niieqrRkzZmjw4MFav369OnbsaDoOABv5/X59+OGH8ng8mjNnjo4cOVLhNa644orv7gdt27Zthb5b\nUFCgYYMH663sbDVyOtXL59MNkuIlRUkqkuSVtEFSltOpgz6f7k5M1LTp0xUTE1PhrEBVQfFEtXTk\nyBG1atVKPXr00KxZs0zHAWDQqVOntHz5cnk8ngvebrN9+/Zyu93q16+ffvGLX5zzs+np6Ro5YoQa\n+nx6zudTkqRa58onab6kJ51OHXY6NWnKFA0aNKjCGYGqgOKJamn48OF67bXXlJubqyZNmpiOAyBE\nfPPNN5o3b548Ho/WrFlT4e9HRETozjvvlNvtVs+ePcvdo5mamqrx48drkKQXJdWtwNrHJY2WlC7p\n2Wef1R/+8IcK5wNCHcUT1c6mTZvUoUMHTZgwQWPGjDEdB0CI2r17tzIyMmRZlnJycir8/aioKPXs\n2VNut1t33nmnZs2apeTkZD0jaXwlcj0j6Y86MzkdOHBgJVYCQg/FE9WK3+/XrbfeqkOHDmnTpk2q\nVetcP3ABwJn/bnzyySfyeDzKzMzUwYMHK7xGw4YNdezrr+UuLVV6ZfNIekRSZu3a2uL1cs8nqhWK\nJ6qVzMxM9e/fXytWrFBiYqLpOACqmNOnTys7O1sej0dvvPGGTp48eV7fi5B0uaTtqtjP6z/lmKS2\nTqfib79dy1esCMCKQGigeKLaKCwsVOvWrXXTTTdpwYIFpuMAqOKOHTumBQsWyOPx6L333tPP/XWZ\nIal/AK8/W9IAnXklU1xcXABXBsyheKLaePLJJzVp0iRt375dzZs3Nx0HQDWyb98+zZ49W5ZlaevW\nreXOXyppv8799HpFlUhq6nSqz9Chmjx5cgBXBsyheKJa2LlzpxISEvTUU0/pT3/6k+k4AKqxTZs2\nybIszZ49W/v371dNSYMkTQvCtYZJWhUbK+/OnUFYHbAfxRPVQvfu3bVt2zZt375dderUMR0HQBgo\nLS3V0qVL1fO++/SqpIeDcI1/SBrkcOjYsWNsr4lqIcJ0AKCyli5dqmXLlunFF1+kdAKwTY0aNdSs\nWTP5dWZHomBI0Jmn7vPy8oJ0BcBeFE9UaSUlJRo5cqQ6d+6snj17mo4DIMyUlJRIOrMNZjD895/S\n/70OUNU5TQcAKuPFF1/Unj17tGTJEjkcDtNxAISZyMhISWf2Xg+G/77M6b/XAao6Jp6osvbt26dn\nn31Wjz32GK8aAWBEbGysHA6HvEFaf5skh8Oh2NjYIF0BsBfFE1XW2LFjVbduXT399NOmowAIU9HR\n0WrdooU2BGn9jZLatGzJg0WoNiieqJJWr16tOXPm6Pnnn1e9evVMxwEQxhK7dVOW06lTAV63RFKW\n06nOXbsGeGXAHF6nhCrH5/OpQ4cOuuiii7R27VpFRPDvJwDmeL1eJSQksHMRcB74GxtVTlpamrZu\n3aqpU6dSOgEYFx8fr7sTE/WU06njAVrzmKQnnU7dnZhI6US1wsQTVcqhQ4fUqlUr9e7dWzNmzDAd\nBwAkSQUFBWobH69+xcWaWcm1/JIekZRZu7a2eL2KiYkJQEIgNDAuQpXyhz/8QZKUmppqOAkA/H8x\nMTGaNGWK0iU9W4l1/N9+P13Sy1OnUjpR7fAeT1QZGzduVHp6uiZPnqzLLrvMdBwA+IFBgwbpwIED\nGj9+vPZIelFS3Qp8/5ik0ZJe1Zl/XA8cODAYMQGj+KkdVUJZWZk6deqkEydO6NNPP5XTyb+ZAISm\n9PR0jRwxQg18Pv3F51OSpFrn+HyJpCxJYyUddDj0yowZGjRokC1ZAbvxtzeqBMuy9OGHH2rVqlWU\nTgAhbdCgQbrzzjs1bPBgDcjO1iinU718Pl2vM3uv19GZHYm26cx7Ol+XdERn7n0r8/vVpk0bY9mB\nYGPiiZB39OhRtW7dWrfffrsyMzNNxwGA8+b1epWWlqZ3li/Xjvx8ff+vXIfOTH9O/+g7PXr00JIl\nS+yMCdiG4omQN2bMGKWlpSknJ0dXXnml6TgAcEEKCwuVl5enkpISRUZG6vLLL1dCQoIOHz5c7rNb\nt25VQkKCgZRAcPFUO0La9u3bNXnyZI0fP57SCaBKi46O1jXXXKObbrpJ11xzjRo3bqzhw4ef9bMT\nJ060OR1gDyaeCFl+v19dunRRQUGBtm3bpsjISNORACCgvvrqKzVt2lQnT578wXGn06mCggL+wY1q\nh4knQtbChQv1zjvvaNKkSZROANVSw4YNz/raJJ/Pp0mTJhlIBAQXE0+EpKKiIsXHxyshIUFvvvmm\n6TgAEDQFBQW66qqrVFpa+oPj0dHR2rt3r+rXr28oGRB4TDwRkiZMmKD9+/fzL34A1V5MTIweeOCB\ncscLCwuVlpZmIBEQPEw8EXJ2796tuLg4jRw5Un/5y19MxwGAoPvss8/UoUOHcscbN26s3bt3q3bt\n2gZSAYHHxBMhZ/To0WrQoMF3+7IDQHV37bXXqkuXLuWOHzhwQK+99pqBREBwUDwRUrKzs7Vw4UJN\nnDhR0dHRpuMAgG1SUlLOenzixInl7v8Eqip+akfIOHXqlNq3b69GjRpp1apVcjgcpiMBgG38fr+u\nv/56ffrpp+XOzZ8/X7169TKQCggsJp4IGVOnTlVubq4mT55M6QQQdhwOh8aNG3fWc88//7yYE6E6\nYOKJkPDll1+qVatWevDBBzV16lTTcQDACJ/Pp9atW2vXrl3lzq1cuVK33Xab/aGAAGLiiZDw+9//\nXrVq1dKf//xn01EAwBin06knnnjirOcmTJhgcxog8Jh4wrj169fr5ptv1vTp0/XII4+YjgMARp08\neVLNmjXToUOHyp3btGmT2rVrZyAVEBhMPGFUaWmpRowYoQ4dOpx12zgACDd16tTRY489dtZzEydO\ntDkNEFhMPGHUzJkz9cgjj2jdunX61a9+ZToOAISEI0eOqGnTpjpx4sQPjteoUUP5+flq1qyZoWRA\n5TDxhDFff/21nnrqKT344IOUTgD4nksvvVTJycnljpeWluqll14ykAgIDCaeMGbEiBH617/+pdzc\nXDVp0sR0HAAIKXv37lWLFi3KvTw+KipKe/fuVYMGDQwlAy4cE0/Y6s0339TJkye1efNmTZs2TU8/\n/TSlEwDOomnTpurXr1+540VFRZo2bZqBREDlMfGEbf7973/ruuuuU9OmTRUVFaXS0lJt3rxZtWrV\nMh0NAELSli1bzvoUe8OGDbVnzx5FRUUZSAVcOCaesIXf79eIESNUVlam3bt3y+v1KioqSvn5+aaj\nAUDIatu2rbp27Vru+FdffaVZs2bZHwioJCaesEVGRoZcLle549HR0dq3b58uvvhiA6kAIPStXr36\nrDsWtWifIH+PAAAX7klEQVTRQjk5OXI6nfaHAi4QE08E3fHjxzV27Niznhs1ahSlEwDO4ZZbbtGN\nN95Y7viuXbuUlZVlIBFw4SieCLrU1FTt37+/3PGmTZvq97//vYFEAFB1OBwOjRs37qznJkyYIH64\nRFXCT+0IqtzcXF199dU6ffp0uXPz5s1TUlKSgVQAULWUlpYqLi5OO3fuLHcuOztbnTt3NpAKqDgm\nnggav9+vkSNHnrV03nHHHerVq5eBVABQ9dSoUeMnb1maMGGCzWmAC8fEE0GzZMkS3XvvveWO16hR\nQ5s2bVJCQoKBVABQNRUXF6t58+Y6cOBAuXOffPKJOnToYCAVUDFMPBEUxcXFGjly5FnPjRgxgtIJ\nABVUu3ZtPf7442c9N3HiRJvTABeGiSeCIjU1VePHjy93/LLLLlNubq4uueQSA6kAoGr75ptv9Mtf\n/lKFhYU/OB4REaGdO3eqRYsWhpIB54eJJwLu888/13PPPXfWc3/9618pnQBwgS655BINHjy43PGy\nsjK9+OKLBhIBFcPEEwHXp08fzZ07t9zxG2+8UevXr1dEBP/eAYALtW/fPrVo0aLcg5t16tTRnj17\ndNlllxlKBvw8GgACauXKlWctnZI0ZcoUSicAVNKVV16pAQMGlDt+8uRJvfrqqwYSAeePiScCxufz\n6dprr9XWrVvLnfvd737HfxABIEC8Xu8PHtKsV6+eJk+erH79+qlWrVoGkwHnRvFEwEyePPmsT1xe\nfPHFys3NVaNGjQykAoDq6d5779U333yjdu3a6e9//7tyc3N11VVXmY4FnBPFEwFx8OBBtWrVSkeP\nHi13btKkST/5ChAAwIUpKipSVFSUiouL1axZM/Xs2VNpaWmmYwHnxA13CIinnnrqrKUzISFBw4YN\nM5AIAKq3qKgoSf///Z6zZs3Sl19+aTgVcG4UT1Tahg0b9I9//OOs56ZMmaKaNWvanAgAwsvQoUNV\ns2ZNTZkyxXQU4JwonqiUsrIyDR8+XGe7Y6N37966/fbbDaQCgPBSv359PfLII5o2bZqOHz9uOg7w\nkyieqJTXXntNH3/8cbnjderU0QsvvGAgEQCEp1GjRqmwsFAzZ840HQX4SRRPXLCjR49q3LhxZz33\n1FNPqWnTpjYnAoDw9d/3e7744os6deqU6TjAWVE8ccH+7//+TwcPHix3vEWLFnriiScMJAKA8DZ2\n7Fj95z//UWZmpukowFnxOiVcEK/Xq/bt28vn85U7t2jRIt17770GUgEA7rnnHhUUFGjz5s3sFoeQ\nw59IVJjf79djjz121tJ5991365577jGQCgAgSSkpKdq2bZuWLVtmOgpQDhNPVFhWVpaSkpLKHa9Z\ns6a2bNmi1q1bG0gFAJDODAc6deokp9OpNWvWmI4D/AATT1RIUVGRRo8efdZzI0eOpHQCgGEOh0Mp\nKSl6//33tX79etNxgB9g4okKefrpp/XnP/+53PHLL79cOTk5qlu3roFUAIDvKysrU3x8vOLi4rRw\n4ULTcYDvMPHEeSsoKNDzzz9/1nMTJkygdAJAiIiIiNDYsWO1aNEi7dixw3Qc4DtMPHHeevbsqTfe\neKPc8U6dOun999+Xw+EwkAoAcDYlJSWKiYlRt27dlJ6ebjoOIIniibMoLCxUXl6eSkpKFBkZqdjY\nWK1bt0533XVXuc86HA598sknuvbaaw0kBQCcy4QJE/S///u/Kigo0C9+8QvTcQCKJ87wer1KS0tT\n9rJlytm16wd7rzscDtVxOlV0+nS57w0ZMkSvvPKKnVEBAOfp6NGjatq0qYYMGfKTt0oBdqJ4hrmC\nggINGzxYb2Vnq5HTqV4+n26QFC8pSlKRJK+kDZJel3REZ24MLpN06aWXKjc3Vw0aNDAVHwDwM8aN\nG6e0tDTt3btXF198sek4CHM8XBTG0tPT1TY+XttXrlSGpM99Pk2T9LCkmyS1/fb/PixpmqT9kjIk\nNdGZPzhdu3aldAJAiHv88cdVXFys6dOnm44CUDzDVWpqqpKTk9WvuFhbfD71l1TrZ75TS1J/STt0\npoxmZGQoNTU12FEBAJXwi1/8Qm63W5MmTVJJSYnpOAhzFM8wlJ6ervHjx+sZSTMlVfQlSHUlpUv6\ns6Tx48fr1VdfDXREAEAAPfHEE/ryyy/l8XhMR0GY4x7PMFNQUKC28fHqV1ysmZVcyy/pEUmZtWtr\ni9ermJiYACQEAARDz549tX37dnm9XkVEMHeCGfzJCzPDBg9WQ59PLwZgLYekv0lq4PNp2ODBAVgR\nABAsKSkpysnJ0eLFi01HQRhj4hlGvF6vEhISlKEz92oGymxJA75dPy4uLoArAwAC6Te/+Y18Pp/W\nrVvHph8wgolnGElLS1Mjp1NJAV63l6RGTifv8wSAEDdu3Dh9+OGHWrt2rekoCFNMPMNIXGysbs/P\n17QgrD1M0qrYWHl37gzC6gCAQCgrK1Pbtm3VokULLVmyxHQchCEmnmHi+PHjytm1SzcEaf3rJe3I\nz1dhYWGQrgAAqKyIiAilpKRo6dKl2rZtm+k4CEMUzzCRn58vv9+v+CCtnyDJ7/crLy8vSFcAAARC\nv379dOWVV2rixImmoyAMUTzDxH9fGhwVpPXr/Og6AIDQVKtWLY0aNUoZGRnat2+f6TgIMxTPMBEZ\nGSnpzN7rwXDyR9cBAISu5ORkRUdH66WXXjIdBWGG4hkmYmNj5XA45A3S+tskORwOxcbGBukKAIBA\nqVu3roYNG6YZM2bo66+/Nh0HYYTiGSaio6PVukULbQjS+hsltWnZUtHR0UG6AgAgkEaMGKHTp0/z\nKjzYiuIZRhK7dVOW06lTAV63RFKW06nOXbsGeGUAQLA0adJEDz30kF5++WUVFxebjoMwQfEMI0OG\nDNFBn0/zA7xulqSDPp+GDh0a4JUBAMH0xBNP6NChQ3rttddMR0GY4AXyYaZrly7avnKltvh8qhuA\n9Y5Jaut0Kv7227V8xYoArAgAsFNSUpI2bdqkHTt2qEaNGqbjoJpj4hlmpk2frq+cTo0OwFp+SWMk\nHXY6NW369ACsCACw27hx45SXl6c33njDdBSEAYpnmImJidGkKVOULunZSqzj//b76ZJenjpVMTEx\nAckHALDXDTfcoNtuu03PP/+8+BEUwUbxDEODBg3Ss88+q/+VlCzpeAW/f0zSI5L+KCk1NVUDBw4M\ndEQAgI3GjRunDRs2aPXq1aajoJrjHs8wlp6erpEjRqiBz6e/+HxKklTrHJ8v0ZkHiZ50OnXY6dTL\nU6dSOgGgGvD7/Wrfvr2uuOIKLV++3HQcVGMUzzBXUFCgYYMH663sbDVyOtXL59P1OrP3eh2d2ZFo\nm868pzPL6dRBn093JyZq2vTp/LwOANWIx+OR2+3Wpk2b1K5dO9NxUE1RPCFJ8nq9SktL0zvLl2tH\nfv4P7vNxOBxq07KlOnftqqFDhyouLs5gUgBAMJw+fVqxsbH6zW9+I4/HYzoOqimKJ8opLCxUXl6e\nSkpKFBkZqdjYWHYkAoAw8PLLL2vMmDHKz89Xs2bNTMdBNUTxBAAAkqQTJ06oadOmcrvdmjRpkuk4\nqIZ4qh0AAEiSLrroIj366KOaOXOmDh8+bDoOqiGKJwAA+M6IESNUVlamadOmmY6Caoif2gEAwA88\n+uijmjt3rvbs2aOoqCjTcVCNMPEEAAA/MGbMGB05ckSzZs0yHQXVDBNPAABQTt++ffXxxx8rNzdX\nTqfTdBxUE0w8AQBAOSkpKSooKFBWVpbpKKhGmHgCAICzSkxM1JEjR7Rx40Y5HA7TcVANMPEEAABn\nlZKSok8//VTvvvuu6SioJph4AgCAs/L7/bruuuvUsGFDrVixwnQcVANMPAEAwFk5HA6lpKQoOztb\nn376qek4qAaYeAIAgJ/k8/nUqlUr3XTTTcrMzDQdB1UcE08AAPCTnE6nxowZo7lz52rXrl2m46CK\no3gCAIBzevjhh3XppZfqxRdfNB0FVRzFEwAAnFNUVJRGjBihf/zjHzp06JDpOKjCKJ4AAOBnPfro\no3I4HJo6darpKKjCKJ4AAOBnNWjQQIMGDdLUqVN14sQJ03FQRVE8AQDAeRk1apSOHj2qV1991XQU\nVFG8TgkAAJw3l8ul999/X3l5eapZs6bpOKhimHgCAIDzNnbsWO3du1dz5841HQVVEBNPAABQIV27\ndtUXX3yhf//733I4HKbjoAph4gkAACokJSVFmzdv1ttvv206CqoYJp4AAKBC/H6/brzxRtWtW1fv\nvfee6TioQph4AgCACnE4HBo3bpxWrlypDRs2mI6DKoSJJwAAqLDS0lK1adNG11xzjebNm2c6DqoI\nJp4AAKDCatSooSeeeEJZWVnKy8szHQdVBBNPAABwQU6ePKnmzZurZ8+eSktLMx0HVQATTwAAcEHq\n1Kmjxx9/XLNmzdKBAwdMx0EVQPEEAAAXbOjQoXI6nZo8ebLpKKgCKJ4AAOCC1a9fX4888oimTZum\n48ePm46DEEfxBAAAlTJq1CgVFhZq5syZpqMgxPFwEQAAqLSHHnpI7733nvLz81WrVi3TcRCimHgC\nAIBKGzt2rPbt26c5c+aYjoIQxsQTAAAERI8ePbR7925t3rxZERHMtlAefyoAAEBAjBs3Ttu2bdPy\n5ctNR0GIYuIJAAACwu/36+abb1bNmjW1Zs0a03EQgph4AgCAgHA4HBo3bpzef/99rV+/3nQchCAm\nngAAIGDKysoUFxen+Ph4LVy40HQchBgmngAAIGAiIiI0duxYLVq0SDt27DAdByGGiScAAAiokpIS\nNW/eXN27d1d6errpOAghTDwBAEBARUZGauTIkbIsS1988YXpOAghFE8AABBwQ4YMUWRkpCZPnmw6\nCkIIxRMAAATcxRdfrCFDhuiVV17R0aNHTcdBiKB4AgCAoBg5cqROnjypGTNmmI6CEMHDRQAAIGgG\nDhyo5cuXq6CgQJGRkabjwDAmngAAIGieeOIJ7d+/XxkZGaajIAQw8QQAAEF13333aceOHfJ6vYqI\nYOYVzvj/PgAACKqUlBTl5ORoyZIlpqPAMCaeAAAg6H7zm9+orKxMa9euNR0FBjHxBAAAQZeSkqJ1\n69bpgw8+MB0FBjHxBAAAQVdWVqa2bduqZcuWWrx4sek4MISJJwAACLqIiAiNHTtWS5Ys0bZt20zH\ngSFMPAEAgC1OnTqlFi1aKDExUf/85z9Nx4EBTDwBAIAtatWqpVGjRikjI0P79u0zHQcGUDwBAIBt\nkpOTFRUVpUmTJpmOAgMongAAwDb16tXTsGHDNH36dH399dem48BmFE8AAGCrxx57TKdPn1ZaWprp\nKLAZDxcBAADbDR48WIsWLdLu3btVu3Zt03FgEyaeAADAdmPGjNHBgwf12muvmY4CGzHxBAAARiQl\nJWnz5s3avn27atSoYToObMDEEwAAGDF27Fjt3LlTb7zxhukosAkTTwAAYMxtt92moqIiffTRR3I4\nHKbjIMiYeAIAAGPGjRunDRs2aPXq1aajwAZMPAEAgDF+v1/t27fXlVdeqWXLlpmOgyBj4gkAAIxx\nOBxKSUnR8uXLtXnzZtNxEGRMPAEAgFGnT59WbGysbrnlFlmWZToOgoiJJwAAMKpmzZoaPXq0MjMz\ntWfPHtNxEEQUTwAAYNzAgQNVr149vfTSS6ajIIgongAAwLjo6GgNHz5cM2fO1OHDh03HQZBQPAEA\nQEgYPny4ysrKNG3aNNNRECQ8XAQAAELGsGHDNG/ePO3du1d16tQxHQcBxsQTAACEjDFjxujIkSP6\n5z//aToKgoCJJwAACCl9+vTRxo0blZOTI6fTaToOAoiJJwAACCkpKSnatWuXFixYYDoKAoyJJwAA\nCDmdO3fW119/rY0bN8rhcJiOgwBh4gkAAELOuHHj9Omnn+q9994zHQUBxMQTAACEHL/frw4dOuiy\nyy7TihUrTMdBgDDxBAAAIcfhcCglJUXZ2dn67LPPTMdBgDDxBAAAIcnn8+mqq65Sx44dlZmZaToO\nAoCJJwAACElOp1NjxozR3LlzVVBQYDoOAoDiCQAAQtbvfvc71a9fX3/7299MR0EAUDwBAEDIioqK\n0ogRI/SPf/xDhw4dMh0HlUTxBAAAIW348OFyOBz6+9//bjoKKoniCQAAQlqDBg00cOBATZkyRSdO\nnDAdB5XAU+0AACDk7d69W7GxsXrppZc0YsQISVJhYaHy8vJUUlKiyMhIxcbGKjo62nBSnAvFEwAA\nVAkDBgzQypUrdf/99+vdt95Szq5d+n6NcTgcat2ihRK7ddOQIUMUHx9vMC3OhuIJAABCXkFBgdz9\n+2vthx/qsogIJZWV6QZJ8ZKiJBVJ8kraICnL6dRBn093JyZq2vTpiomJMRkd30PxBAAAIS09PV0j\nR4xQQ59Pz/l8SpJU6xyfPyVpvqQnnU4ddjo1acoUDRo0yJ6wOCceLgIAACErNTVVycnJ6ldcrC0+\nn/rr3KVT357vL2mrz6d+xcVKTk5Wampq8MPiZzHxBAAAISk9PV3Jycl6RtL4SqzzjKQ/frvewIED\nAxMOF4TiCQAAQk5BQYHaxserX3GxZlZyLb+kRyRl1q6tLV4v93waRPEEAAAhp2uXLtq+cqW2+Hyq\nG4D1jklq63Qq/vbbtXzFigCsiAtB8QQAACHF6/UqISFBGTpzr2agzJY04Nv14+LiArgyzhcPFwEA\ngJCSlpamRk6nkgK8bi9JjZxOvfLKKwFeGeeL4gkAAEJK9rJl6uXz/ezT6xUVKamXz6d3li8P8Mo4\nXxRPAAAQMo4fP66cXbt0Q5DWv17Sjvx8FRYWBukKOBeKJwAACBn5+fny+/0K1maXCZL8fr/y8vKC\ndAWcC8UTAACEjJKSEklntsEMhjo/ug7sRfEEAAAhIzIyUtKZvdeD4eSPrgN7UTwBAEDIiI2NlcPh\nkDdI62+T5HA4FBsbG6Qr4FwongAAIGRER0erdYsW2hCk9TdKatOypaKjo4N0BZwLxRMAAISUxG7d\nlOV06lSA1y2RlOV0qnPXrgFeGeeL4gkAAELKkCFDdNDn0/wAr5sl6aDPp6FDhwZ4ZZwvtswEAAAh\nh73aqyeKJwAACDkFBQVqGx+vfsXFmlnJtfySHpGUWbu2tni9iomJCUBCXAh+agcAACEnJiZGk6ZM\nUbqkZyuxjv/b76dLennqVEqnYU7TAQAAAM5m0KBBOnDggMaPH689kl6UKvSz+zFJY3SmdKampmrg\nwIHBiIkK4Kd2AAAQ0tLT0zVyxAg18Pn0F59PSZJqnePzJTrzINGTTqcOO516eepUSmeIoHgCAICQ\nV1BQoGGDB+ut7Gw1cjrVy+fT9Tqz93odndmRaJvOvKczy+nUQZ9Pdycmatr06fy8HkIongAAoMrw\ner1KS0vTO8uXa0d+vr5fYxwOh9q0bKnOXbtq6NChiouLM5gUZ0PxBAAAVVJhYaHy8vJUUlKiyMhI\nxcbGsiNRiKN4AgAAwBa8TgkAAAC2oHgCAADAFhRPAAAA2ILiCQAAAFtQPAEAAGALiicAAABsQfEE\nAACALSieAAAAsAXFEwAAALageAIAAMAWFE8AAADYguIJAAAAW1A8AQAAYAuKJwAAAGxB8QQAAIAt\nKJ4AAACwBcUTAAAAtqB4AgAAwBYUTwAAANiC4gkAAABbUDwBAABgC4onAAAAbEHxBAAAgC0ongAA\nALAFxRMAAAC2oHgCAADAFhRPAAAA2ILiCQAAAFtQPAEAAGALiicAAABsQfEEAACALSieAAAAsAXF\nEwAAALageAIAAMAWFE8AAADYguIJAAAAW1A8AQAAYAuKJwAAAGxB8QQAAIAtKJ4AAACwBcUTAAAA\ntqB4AgAAwBYUTwAAANiC4gkAAABbUDwBAABgC4onAAAAbEHxBAAAgC0ongAAALAFxRMAAAC2oHgC\nAADAFhRPAAAA2ILiCQAAAFtQPAEAAGALiicAAABsQfEEAACALSieAAAAsAXFEwAAALageAIAAMAW\nFE8AAADYguIJAAAAW1A8AQAAYAuKJwAAAGxB8QQAAIAtKJ4AAACwBcUTAAAAtqB4AgAAwBYUTwAA\nANiC4gkAAABbUDwBAABgC4onAAAAbEHxBAAAgC0ongAAALAFxRMAAAC2oHgCAADAFhRPAAAA2ILi\nCQAAAFtQPAEAAGALiicAAABsQfEEAACALSieAAAAsAXFEwAAALb4f+3ZNfMEAY7AAAAAAElFTkSu\nQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x112e43b00>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Pandas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "#### JGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "import jgraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-1ed3ea17-fa46-4a08-9f56-a48b3a5c3b5d\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-1ed3ea17-fa46-4a08-9f56-a48b3a5c3b5d');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": \"Drew\", \"target\": \"Mountain Dew\" },\n",
       "        { \"source\": \"Nicole\", \"target\": \"Mountain Dew\" },\n",
       "        { \"source\": \"Nicole\", \"target\": \"Coke Zero\" }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"Coke Zero\": { \"location\": [ -0.9327971468331143, -0.4611271834152691, -0.3590146682501429 ] },\n",
       "        \"Drew\": { \"location\": [ 1.7167867087767794, 1.539642581528163, 1.6253233209126268 ] },\n",
       "        \"Mountain Dew\": { \"location\": [ -1.3536506592842474, -1.581103284272765, -1.552076259455487 ] },\n",
       "        \"Nicole\": { \"location\": [ 0.5696610973405822, 0.502587886159871, 0.2857676067930032 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "ig = jgraph.draw(tups)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-f4a74b53-db7d-4a30-9b57-cff404ed9a26\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-f4a74b53-db7d-4a30-9b57-cff404ed9a26');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"2\": { \"location\": [ -1.1425492297305186, -1.6136685501981183, -0.8465977358759678 ] },\n",
       "        \"3\": { \"location\": [ -0.07722294859051632, 0.24954062731332335, -0.025703991594558356 ] },\n",
       "        \"4\": { \"location\": [ 1.4019242290285023, 1.2065267140234843, 1.04001177112093 ] },\n",
       "        \"5\": { \"location\": [ 2.0, 2.0, 1.9016942732863789 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
